import 'package:flutter/material.dart';

import '../../custem_widget.dart';

class BurnCases extends StatelessWidget {
   BurnCases({super.key});
 String burnCareSteps = '''
1- أغسل مكان الحرق بماء بارد جارٍ لا يكون شديد الاندفاع.
2- إنزع أي شيء ضيق مثل الخواتم أو ما شابه ذلك قبل حدوث تورم وصعوبة نزعها فيما بعد.
3- ثم قم بتغطية الحرق بقطعة قماش طرية ومبللة بماء بارد حتى يزول الألم (غالبا ما تكفي مدة خمسة عشر دقيقة لزوال الألم).
4- أو قم بلف مكعبات من الثلج بقماش نظيف بصورة ككمادة وتوضع فوق المنطقة المصابة لمدة عشرين دقيقة، ثم ترفع لمدة عشرة دقائق قبل أن يعاد وضعها كالسابق، وهكذا تستمر الدورة، ويجب تفادي وضع الثلج مباشرة على الجلد أو إبقاء الكمادة الثلجية فوق المكان المحروق أكثر من عشرين دقيقة لأن ذلك قد يسبب ما يسمى بعضة الصقيع.
5- لا تحاول استعمال العلاجات المنزلية أو كمادات الثلج إذا كانت حروق الدرجتين الأولى والثانية تغطي مساحة أكبر من مساحة خمسة كفوف لأن وضع كمادات ثلجية على مثل هذه المساحة الكبيرة يمكن أن يسبب نقص حرارة الجسم مما قد يهدد الحياة، بدلاً من ذلك اطلب العون الطبي بأسرع ما يمكن.
6- عندما يخف الألم ضع على الحرق مرهمًا أو كريمًا خاصًا بالحروق مثل كريم درمازين.
''';
String burnCareInstructions = '''
1- أغسل مكان الحرق بماء بارد ولا تخرب الفقاعات.
2- ثم اتصل بالطبيب.
3- لا تحاول نزع الملابس إذا كانت قد التصقت.
4- لا تغطي الحرق.
5- كل حرق في الوجه أو اليدين أو القدمين أو الأعضاء التناسلية يجب أن يتم مشاهدته من قبل الطبيب في أقرب وقت.
''';
  String burnCareInstructions2 = '''
1- قم بإبعاد المصاب عن مصدر الحرق فورا.
2- اتصل بالإسعاف مباشرة أو قم بإسعاف المصاب بنفسك وريثما يحضر الإسعاف، قم بإزالة كافة الألبسة من على جسم المصاب.
3- لا تقم بوضع أية أدوية أو مراهم أو مواد منزلية على الحرق.
4- يمكن تغطية المنطقة المصابة بقماش نظيف لإبعاد الهواء عنها حتى تأتى الإسعاف.
''';
  @override
  Widget build(BuildContext context) {
    return CustemWidget(
        headImage: "assets/images/5.jpg",
        headTitle:"حالات الحروق",

        sacandTitel: "الحروق البسيطة دون فقاعات",
        description: burnCareSteps,
        sacandImage: "assets/images/55555.jpg",
        headTitle2:" الحروق المترافقة بالفقاعات",

        description2: burnCareInstructions,
        sacandTitle2:" الحروق الكبيرة أو العميقة"
,
        description3: burnCareInstructions2,
        sacandImage2: "assets/images/5555.jpg");
  }
}
