import 'package:flutter/material.dart';


import '../../custem_widget.dart';

class DiabeticComaScreen extends StatelessWidget {
  const DiabeticComaScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return const CustemWidget(
        headImage: "assets/images/photo1.png",
        headTitle: 'غيبوبة سكر',
        sacandTitel: 'اسعافات غيبوبة السكر',
        description:
            '- قياس السكر العشوائي لمعرفة الوضع الصحي للمريض.\n-إعطاء المريض على الفور (في حالة كان واعيًا) سكريات سريعة الامتصاص مثل قطعة حلوى، شوكولاتة، عصير، ماء محلى بالسكر، أو عن طريق المحاليل التي تُعطى عن طريق الوريد، لاستعادة مستويات السكر في الدم.\n- الذهاب إلى أقرب مستشفى إذا اقتضت الحاجة.\n- إعطاؤه قطعة من السكر تحت اللسان، أو محلول سكري عبر الوريد حال كان المريض فاقدًا للوعي، ومراقبة درجة حرارته والمحافظة عليها ضمن الحد الطبيعي، ومراقبة التنفس والضغط باستمرار حتى التوجه إلى أقرب مستشفى.',
        sacandImage: "assets/images/photo2.png",
        headTitle2: 'كيف يتم علاج الغيبوبة السكرية؟',
        description2:
            'قد يحتاج المريض أيضًا الحصول على الأنسولين لمساعدة الخلايا على امتصاص الجلوكوز الزائد في الدورة الدموية، وفي حال كانت مستويات الصوديوم أو البوتاسيوم منخفضة، فقد يحصل الفرد على مكملات للمساعدة في رفعها إلى مستويات صحية. كما يساعد حقن الجلوكاجون في زيادة مستويات السكر في الدم في حال نقص السكر في الدم.',
        sacandTitle2: 'أعراض ارتفاع سكر الدم',
        description3:
            'زيادة إدرار البول.\nالإصابة بالجوع والعطش.\nهبوط الدورة الدموية أو بدايات الغيبوبة وفقدان الوعي.\nجفاف الفم وتغير رائحة نفس المريض لتشبه رائحة الفواكه.\nآلام بالمعدة.',
        sacandImage2: "assets/images/photo3.png");
  }
}
